{
    "_name_or_path": "/mnt/pfs/zitao_team/liuchangkun1/repos/tiny-gpt/1215/Llama-2-7b-hf",
    "architectures": [
        "LlamaForCotCausalLM"
    ],
    "attention_bias": false,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 2048,
    "model_type": "llama",
    "mse_ratio": 10.0,
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "pad_token_id": 0,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
        "factor": 2.0,
        "type": "linear"
    },
    "rope_theta": 10000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.34.0",
    "use_cache": false,
    "vocab_size": 32000,
    "cot_model_path": "/mnt/pfs/zitao_team/liuchangkun1/repos/tiny-gpt/1215/output/7b-bs-128-mse-10-0/checkpoint-1200"
}